Catalogs/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>СтавкиНДС</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ставка</Name>
					<Comment>Ставка НДС, % </Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляОсвобожденногоОборота</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоРеализацииНеРК</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СтавкиНДС/Forms/ФормаЭлемента/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.Ставка.Доступность = НЕ  (Объект.ДляОсвобожденногоОборота ИЛИ Объект.МестоРеализацииНеРК);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура СтавкаПриИзменении(Элемент)
	
	Объект.Наименование = "";
	СформироватьНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура ДляОсвобожденногоОборотаПриИзменении(Элемент)
	
	Если Объект.ДляОсвобожденногоОборота Тогда
		Объект.Ставка = 0;
		Объект.МестоРеализацииНеРК = Ложь;
	КонецЕсли;
	
	Элементы.Ставка.Доступность = НЕ (Объект.ДляОсвобожденногоОборота ИЛИ Объект.МестоРеализацииНеРК);
	
	Объект.Наименование = "";
	СформироватьНаименование();

КонецПроцедуры

&НаКлиенте
Процедура МестоРеализацииНеРКПриИзменении(Элемент)
	
	Если Объект.МестоРеализацииНеРК Тогда
		Объект.Ставка = 0;
		Объект.ДляОсвобожденногоОборота = Ложь;
	КонецЕсли;
	
	Элементы.Ставка.Доступность = НЕ (Объект.ДляОсвобожденногоОборота ИЛИ Объект.МестоРеализацииНеРК);
	
	Объект.Наименование = "";
	СформироватьНаименование();

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура проверяет, необходимо ли сформировать новое наименование справочника 
// и, если необходимо, формирует его.
//
// Параметры:
//  Нет.
//
&НаКлиенте
Процедура СформироватьНаименование()
	
	Если  ПустаяСтрока(Объект.Наименование) Тогда
		
		Если Объект.ДляОсвобожденногоОборота Тогда
			Объект.Наименование = НСтр("ru = 'без НДС'", ОбщегоНазначенияКлиент.КодОсновногоЯзыка());
		ИначеЕсли Объект.МестоРеализацииНеРК Тогда
			Объект.Наименование = НСтр("ru = 'без НДС - не РК'", ОбщегоНазначенияКлиент.КодОсновногоЯзыка());
		Иначе
			Объект.Наименование = Строка(Объект.Ставка)+"%";
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // СформироватьНаименованиеПолноеАвтоматически()
